@vaerh I tried a couple of times, and the module execution consistently failed for me, however the certificate every time was successfully created. Here is an example execution log:

```sh
heuels at 0x686575656c73 in ~/Projects/example.com/.terraform/gw1.example.com (main) 
$ tofu apply
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - terraform-routeros/routeros in ~/Projects/terraform-provider-routeros
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the
│ state to become incompatible with published releases.
╵

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated
with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.example_letsencrypt.routeros_system_certificate_acme.letsencrypt will be created
  + resource "routeros_system_certificate_acme" "letsencrypt" {
      + akid             = (known after apply)
      + common_name      = (known after apply)
      + country          = (known after apply)
      + crl              = (known after apply)
      + days_valid       = (known after apply)
      + digest_algorithm = (known after apply)
      + directory_url    = "https://acme-staging-v02.api.letsencrypt.org/directory"
      + dns_name         = "gw1.example.com"
      + expired          = (known after apply)
      + expires_after    = (known after apply)
      + fingerprint      = (known after apply)
      + id               = (known after apply)
      + invalid_after    = (known after apply)
      + invalid_before   = (known after apply)
      + issued           = (known after apply)
      + issuer           = (known after apply)
      + key_size         = (known after apply)
      + key_type         = (known after apply)
      + key_usage        = (known after apply)
      + locality         = (known after apply)
      + name             = (known after apply)
      + organization     = (known after apply)
      + private_key      = (known after apply)
      + serial_number    = (known after apply)
      + skid             = (known after apply)
      + state            = (known after apply)
      + subject_alt_name = (known after apply)
      + trusted          = (known after apply)
      + unit             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  OpenTofu will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.example_letsencrypt.routeros_system_certificate_acme.letsencrypt: Creating...
module.example_letsencrypt.routeros_system_certificate_acme.letsencrypt: Still creating... [10s elapsed]
module.example_letsencrypt.routeros_system_certificate_acme.letsencrypt: Still creating... [20s elapsed]
module.example_letsencrypt.routeros_system_certificate_acme.letsencrypt: Still creating... [30s elapsed]
module.example_letsencrypt.routeros_system_certificate_acme.letsencrypt: Still creating... [40s elapsed]
╷
│ Error: resource no longer exists
│ 
│   with module.example_letsencrypt.routeros_system_certificate_acme.letsencrypt,
│   on ../_modules/example_letsencrypt/main.tf line 12, in resource "routeros_system_certificate_acme" "letsencrypt":
│   12: resource "routeros_system_certificate_acme" "letsencrypt" {
│ 
╵

```